#include "revenuerow.h"

/////////////////методы класса RevenueRow/////////////////////
RevenueRow::RevenueRow(int ar) : art(ar) //конструктор
{ //Алгоритм fill() помещает копию значения value (у нас это 0)
//в каждый элемент диапазона, ограниченного парой итераторов [first,last).
//Т.е. в конструкторе просто инициализируем массив значениями 0.
    float a = 0.0;
    fill(&revenue[0], &revenue[12], a);
}
//---------------------------------------------------------
void RevenueRow::setRevenue(int m, int am, float pr) // сеттер выручка за месяц m, выручка - pr * am
{
    revenue[m] = pr * am; // привязываем оплату к месяцу
}
//---------------------------------------------------------
int RevenueRow::getArt() // геттер запрос артикула
{
    return art;
}
//---------------------------------------------------------
float RevenueRow::getRevenueM(int month) //Геттер запрос выручки за месяц month
{
    return revenue[month];
}
//---------------------------------------------------------
float RevenueRow::getSumOfRow() // cумма выручек в строке
{ //По умолчанию алгоритм accumulate() суммирует элементы.
 //Нужно указать точку старта, конечную точку и значение от которого начинаем прибавлять.
    float a = accumulate(&revenue[0], &revenue[12], revenue[0]);
    return a;
}
